blog-posts/2004-01-02-blogging-is-alive-and-well-under-emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Blogging is alive and well under Emacs</title>
<!-- 2014-04-30 Wed 17:46 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Blogging is alive and well under Emacs</h1>
<p>
January 2nd, 2004 -
<a href="http://sachachua.com/blog/p/1570"><a href="http://sachachua.com/blog/p/1570">http://sachachua.com/blog/p/1570</a></a>
</p>

<p>
in reaction to
<a href="http://www.sfu.ca/~gswamina/BlogsAreDead.html"><a href="http://www.sfu.ca/~gswamina/BlogsAreDead.html">http://www.sfu.ca/~gswamina/BlogsAreDead.html</a></a>
</p>

<p>
I've had a blog for roughly a year and a half now, and I think I'm
 pretty much settling into the routine. Reading
<a href="http://www.sfu.ca/~gswamina/BlogsAreDead.html">Ganesh's BlogsAreDead</a>
post, I think about how I use Emacs to keep track of my notes.
</p>

<blockquote>
<p>
Linearity &#x2013; Blogs are linear, ie usually in chronological
 order. My knowledge/experience is non-linear (fortunately). There is
 an obvious mismatch here. I don't see how I can write coherently
about
 recursive functions, pipelines, privacy and chicks in the same
 post.
</p>
</blockquote>

<p>
I split this up into several remember-to-planner-plan-page-dwim posts,
 usually cross-linking them with a topic page.
</p>

<blockquote>
<p>
Lack of time &#x2013; Everybody seems to be bringing this up. I
 don't post very often, but when I do, they are long ones. If you've
 noticed, my titles are usually one or two words &#x2013; “Skills”, “04-1
 Registered”, “Talks”, “Its Tuesday”, $(rand dict). Not very
 descriptive. Often, I remember writing about something, but not able
 to track it down. Sad, really.
</p>
</blockquote>

<p>
My titles aren't all that descriptive either, but that's what M-x
 planner-search-notes in planner-experimental.el is for. And yes, I
 really hate it if I know I blogged about something but I can't
 remember how to bring it up.
</p>

<blockquote>
<p>
Non-conformance to standards &#x2013; When you put together an entry, do
 you check if it confirms to W3C standards every time ? Honestly,
 that's insane. A standard transformation mapping will make life so
 much easier. I now face a problem, how do I convert my old entries ?
 I seem to have used three to four different ways to post my code,
 all of them every inelegant, except for the last.
</p>
</blockquote>

<p>
I work with plain text.
</p>

<blockquote>
<p>
Immature &#x2013; Blogging software is not powerful enough. What
 if I want to quote an email message, or a news thread ? Or simple
 syntax highlighting ? Or even on the fly spell checking (known as
 flyspell-mode in emacs, BTW). Couple this with my non-descriptive
 titles, how do I cross reference things ?
</p>
</blockquote>

<p>
Emacs is wonderful!
</p>

<blockquote>
<p>
Not cool &#x2013; Blogs aren't cool anymore, since every kid
 happens to have his own. When you come across somebody's blog which
 appears to be very interesting, do you take the time to read through
 his archives ? Ofcourse not. More bit bricks.
</p>
</blockquote>

<p>
I often read through other people's archives. I hope that the
 cross-references with plan pages make it easier for people to see
 related stuff, but I plan to have some kind of search someday.
</p>

<blockquote>
<p>
Stagnant &#x2013; “The only thing that is constant is change.”
 Spring-&gt;Summer-&gt;Fall, so many things change around you. About 28.5%
 (eh !) of your content is stale. Your views on life constantly change
 (you may deny it). Going back and changing stuff just doesn't make
 sense when your entries are chronological.
</p>
</blockquote>

<p>
I frequently go back and post updates. I also tend to reorganize the
 plan pages fairly often, although that does mean semi-broken day
 links. (Must get those GUIDs up and running!)
</p>

<p>
Emacs is way cool.
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
